MikroElektronika/core_packages/PIC/XC8/def/PIC18LF24J50/mcu.h
extern volatile PORTCbits_t PORTCbits __at(0xF82);
// bitfield macros
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_RC6_POSN                                     0x6
#define _PORTC_RC6_POSITION                                 0x6
#define _PORTC_RC6_SIZE                                     0x1
#define _PORTC_RC6_LENGTH                                   0x1
#define _PORTC_RC6_MASK                                     0x40
#define _PORTC_RC7_POSN                                     0x7
#define _PORTC_RC7_POSITION                                 0x7
#define _PORTC_RC7_SIZE                                     0x1
#define _PORTC_RC7_LENGTH                                   0x1
#define _PORTC_RC7_MASK                                     0x80
#define _PORTC_T1OSO_POSN                                   0x0
#define _PORTC_T1OSO_POSITION                               0x0
#define _PORTC_T1OSO_SIZE                                   0x1
#define _PORTC_T1OSO_LENGTH                                 0x1
#define _PORTC_T1OSO_MASK                                   0x1
#define _PORTC_T1OSI_POSN                                   0x1
#define _PORTC_T1OSI_POSITION                               0x1
#define _PORTC_T1OSI_SIZE                                   0x1
#define _PORTC_T1OSI_LENGTH                                 0x1
#define _PORTC_T1OSI_MASK                                   0x2
#define _PORTC_AN11_POSN                                    0x2
#define _PORTC_AN11_POSITION                                0x2
#define _PORTC_AN11_SIZE                                    0x1
#define _PORTC_AN11_LENGTH                                  0x1
#define _PORTC_AN11_MASK                                    0x4
#define _PORTC_D_MINUS_POSN                                 0x4
#define _PORTC_D_MINUS_POSITION                             0x4
#define _PORTC_D_MINUS_SIZE                                 0x1
#define _PORTC_D_MINUS_LENGTH                               0x1
#define _PORTC_D_MINUS_MASK                                 0x10
#define _PORTC_D_PLUS_POSN                                  0x5
#define _PORTC_D_PLUS_POSITION                              0x5
#define _PORTC_D_PLUS_SIZE                                  0x1
#define _PORTC_D_PLUS_LENGTH                                0x1
#define _PORTC_D_PLUS_MASK                                  0x20
#define _PORTC_NOT_UOE_POSN                                 0x1
#define _PORTC_NOT_UOE_POSITION                             0x1
#define _PORTC_NOT_UOE_SIZE                                 0x1
#define _PORTC_NOT_UOE_LENGTH                               0x1
#define _PORTC_NOT_UOE_MASK                                 0x2
#define _PORTC_T1CK_POSN                                    0x0
#define _PORTC_T1CK_POSITION                                0x0
#define _PORTC_T1CK_SIZE                                    0x1
#define _PORTC_T1CK_LENGTH                                  0x1
#define _PORTC_T1CK_MASK                                    0x1
#define _PORTC_nUOE_POSN                                    0x1
#define _PORTC_nUOE_POSITION                                0x1
#define _PORTC_nUOE_SIZE                                    0x1
#define _PORTC_nUOE_LENGTH                                  0x1
#define _PORTC_nUOE_MASK                                    0x2
#define _PORTC_CTPLS_POSN                                   0x2
#define _PORTC_CTPLS_POSITION                               0x2
#define _PORTC_CTPLS_SIZE                                   0x1
#define _PORTC_CTPLS_LENGTH                                 0x1
#define _PORTC_CTPLS_MASK                                   0x4
#define _PORTC_VM_POSN                                      0x4
#define _PORTC_VM_POSITION                                  0x4
#define _PORTC_VM_SIZE                                      0x1
#define _PORTC_VM_LENGTH                                    0x1
#define _PORTC_VM_MASK                                      0x10
#define _PORTC_VP_POSN                                      0x5
#define _PORTC_VP_POSITION                                  0x5
#define _PORTC_VP_SIZE                                      0x1
#define _PORTC_VP_LENGTH                                    0x1
#define _PORTC_VP_MASK                                      0x20
#define _PORTC_TX1_POSN                                     0x6
#define _PORTC_TX1_POSITION                                 0x6
#define _PORTC_TX1_SIZE                                     0x1
#define _PORTC_TX1_LENGTH                                   0x1
#define _PORTC_TX1_MASK                                     0x40
#define _PORTC_RX1_POSN                                     0x7
#define _PORTC_RX1_POSITION                                 0x7
#define _PORTC_RX1_SIZE                                     0x1
#define _PORTC_RX1_LENGTH                                   0x1
#define _PORTC_RX1_MASK                                     0x80
#define _PORTC_RP11_POSN                                    0x0
#define _PORTC_RP11_POSITION                                0x0
#define _PORTC_RP11_SIZE                                    0x1
#define _PORTC_RP11_LENGTH                                  0x1
#define _PORTC_RP11_MASK                                    0x1
#define _PORTC_RP12_POSN                                    0x1
#define _PORTC_RP12_POSITION                                0x1
#define _PORTC_RP12_SIZE                                    0x1
#define _PORTC_RP12_LENGTH                                  0x1
#define _PORTC_RP12_MASK                                    0x2
#define _PORTC_RP13_POSN                                    0x2
#define _PORTC_RP13_POSITION                                0x2
#define _PORTC_RP13_SIZE                                    0x1
#define _PORTC_RP13_LENGTH                                  0x1
#define _PORTC_RP13_MASK                                    0x4
#define _PORTC_CK1_POSN                                     0x6
#define _PORTC_CK1_POSITION                                 0x6
#define _PORTC_CK1_SIZE                                     0x1
#define _PORTC_CK1_LENGTH                                   0x1
#define _PORTC_CK1_MASK                                     0x40
#define _PORTC_DT1_POSN                                     0x7
#define _PORTC_DT1_POSITION                                 0x7
#define _PORTC_DT1_SIZE                                     0x1
#define _PORTC_DT1_LENGTH                                   0x1
#define _PORTC_DT1_MASK                                     0x80
#define _PORTC_RP17_POSN                                    0x6
#define _PORTC_RP17_POSITION                                0x6
#define _PORTC_RP17_SIZE                                    0x1
#define _PORTC_RP17_LENGTH                                  0x1
#define _PORTC_RP17_MASK                                    0x40
#define _PORTC_SDO1_POSN                                    0x7
#define _PORTC_SDO1_POSITION                                0x7
#define _PORTC_SDO1_SIZE                                    0x1
#define _PORTC_SDO1_LENGTH                                  0x1
#define _PORTC_SDO1_MASK                                    0x80
#define _PORTC_RP18_POSN                                    0x7
#define _PORTC_RP18_POSITION                                0x7
#define _PORTC_RP18_SIZE                                    0x1
#define _PORTC_RP18_LENGTH                                  0x1
#define _PORTC_RP18_MASK                                    0x80
#define _PORTC_CCP2_POSN                                    0x1
#define _PORTC_CCP2_POSITION                                0x1
#define _PORTC_CCP2_SIZE                                    0x1
#define _PORTC_CCP2_LENGTH                                  0x1
#define _PORTC_CCP2_MASK                                    0x2
#define _PORTC_PA1_POSN                                     0x2
#define _PORTC_PA1_POSITION                                 0x2
#define _PORTC_PA1_SIZE                                     0x1
#define _PORTC_PA1_LENGTH                                   0x1
#define _PORTC_PA1_MASK                                     0x4
#define _PORTC_PA2_POSN                                     0x1
#define _PORTC_PA2_POSITION                                 0x1
#define _PORTC_PA2_SIZE                                     0x1
#define _PORTC_PA2_LENGTH                                   0x1
#define _PORTC_PA2_MASK                                     0x2

// Register: HLVDCON
#define HLVDCON HLVDCON
extern volatile unsigned char           HLVDCON             __at(0xF85);
#ifndef _LIB_BUILD
asm("HLVDCON equ 0F85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLVDL                  :4;
        unsigned HLVDEN                 :1;
        unsigned IRVST                  :1;
        unsigned BGVST                  :1;
        unsigned VDIRMAG                :1;
    };
    struct {
        unsigned HLVDL0                 :1;
        unsigned HLVDL1                 :1;
        unsigned HLVDL2                 :1;
        unsigned HLVDL3                 :1;
    };
} HLVDCONbits_t;
extern volatile HLVDCONbits_t HLVDCONbits __at(0xF85);
// bitfield macros
#define _HLVDCON_HLVDL_POSN                                 0x0
#define _HLVDCON_HLVDL_POSITION                             0x0
#define _HLVDCON_HLVDL_SIZE                                 0x4
#define _HLVDCON_HLVDL_LENGTH                               0x4
#define _HLVDCON_HLVDL_MASK                                 0xF
#define _HLVDCON_HLVDEN_POSN                                0x4
#define _HLVDCON_HLVDEN_POSITION                            0x4
#define _HLVDCON_HLVDEN_SIZE                                0x1
#define _HLVDCON_HLVDEN_LENGTH                              0x1
#define _HLVDCON_HLVDEN_MASK                                0x10
#define _HLVDCON_IRVST_POSN                                 0x5
#define _HLVDCON_IRVST_POSITION                             0x5
#define _HLVDCON_IRVST_SIZE                                 0x1
#define _HLVDCON_IRVST_LENGTH                               0x1
#define _HLVDCON_IRVST_MASK                                 0x20
#define _HLVDCON_BGVST_POSN                                 0x6
#define _HLVDCON_BGVST_POSITION                             0x6
#define _HLVDCON_BGVST_SIZE                                 0x1
#define _HLVDCON_BGVST_LENGTH                               0x1
#define _HLVDCON_BGVST_MASK                                 0x40
#define _HLVDCON_VDIRMAG_POSN                               0x7
#define _HLVDCON_VDIRMAG_POSITION                           0x7
#define _HLVDCON_VDIRMAG_SIZE                               0x1
#define _HLVDCON_VDIRMAG_LENGTH                             0x1
#define _HLVDCON_VDIRMAG_MASK                               0x80
#define _HLVDCON_HLVDL0_POSN                                0x0
#define _HLVDCON_HLVDL0_POSITION                            0x0
#define _HLVDCON_HLVDL0_SIZE                                0x1
#define _HLVDCON_HLVDL0_LENGTH                              0x1
#define _HLVDCON_HLVDL0_MASK                                0x1
#define _HLVDCON_HLVDL1_POSN                                0x1
#define _HLVDCON_HLVDL1_POSITION                            0x1
#define _HLVDCON_HLVDL1_SIZE                                0x1
#define _HLVDCON_HLVDL1_LENGTH                              0x1
#define _HLVDCON_HLVDL1_MASK                                0x2
#define _HLVDCON_HLVDL2_POSN                                0x2
#define _HLVDCON_HLVDL2_POSITION                            0x2
#define _HLVDCON_HLVDL2_SIZE                                0x1
#define _HLVDCON_HLVDL2_LENGTH                              0x1
#define _HLVDCON_HLVDL2_MASK                                0x4
#define _HLVDCON_HLVDL3_POSN                                0x3
#define _HLVDCON_HLVDL3_POSITION                            0x3
#define _HLVDCON_HLVDL3_SIZE                                0x1
#define _HLVDCON_HLVDL3_LENGTH                              0x1
#define _HLVDCON_HLVDL3_MASK                                0x8

// Register: DMACON2
#define DMACON2 DMACON2
extern volatile unsigned char           DMACON2             __at(0xF86);
#ifndef _LIB_BUILD
asm("DMACON2 equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTLVL                 :4;
        unsigned DLYCYC                 :4;
    };
    struct {
        unsigned INTLVL0                :1;
        unsigned INTLVL1                :1;
        unsigned INTLVL2                :1;
        unsigned INTLVL3                :1;
        unsigned DLYCYC0                :1;
        unsigned DLYCYC1                :1;
        unsigned DLYCYC2                :1;
        unsigned DLYCYC3                :1;
    };
} DMACON2bits_t;
extern volatile DMACON2bits_t DMACON2bits __at(0xF86);
// bitfield macros
#define _DMACON2_INTLVL_POSN                                0x0
#define _DMACON2_INTLVL_POSITION                            0x0
#define _DMACON2_INTLVL_SIZE                                0x4
#define _DMACON2_INTLVL_LENGTH                              0x4
#define _DMACON2_INTLVL_MASK                                0xF
#define _DMACON2_DLYCYC_POSN                                0x4
#define _DMACON2_DLYCYC_POSITION                            0x4
#define _DMACON2_DLYCYC_SIZE                                0x4
#define _DMACON2_DLYCYC_LENGTH                              0x4
#define _DMACON2_DLYCYC_MASK                                0xF0
#define _DMACON2_INTLVL0_POSN                               0x0
#define _DMACON2_INTLVL0_POSITION                           0x0
#define _DMACON2_INTLVL0_SIZE                               0x1
#define _DMACON2_INTLVL0_LENGTH                             0x1
#define _DMACON2_INTLVL0_MASK                               0x1
#define _DMACON2_INTLVL1_POSN                               0x1
#define _DMACON2_INTLVL1_POSITION                           0x1
#define _DMACON2_INTLVL1_SIZE                               0x1
#define _DMACON2_INTLVL1_LENGTH                             0x1
#define _DMACON2_INTLVL1_MASK                               0x2
#define _DMACON2_INTLVL2_POSN                               0x2
#define _DMACON2_INTLVL2_POSITION                           0x2
#define _DMACON2_INTLVL2_SIZE                               0x1
#define _DMACON2_INTLVL2_LENGTH                             0x1
#define _DMACON2_INTLVL2_MASK                               0x4
#define _DMACON2_INTLVL3_POSN                               0x3
#define _DMACON2_INTLVL3_POSITION                           0x3
#define _DMACON2_INTLVL3_SIZE                               0x1
#define _DMACON2_INTLVL3_LENGTH                             0x1
#define _DMACON2_INTLVL3_MASK                               0x8
#define _DMACON2_DLYCYC0_POSN                               0x4
#define _DMACON2_DLYCYC0_POSITION                           0x4
#define _DMACON2_DLYCYC0_SIZE                               0x1
#define _DMACON2_DLYCYC0_LENGTH                             0x1
#define _DMACON2_DLYCYC0_MASK                               0x10
#define _DMACON2_DLYCYC1_POSN                               0x5
#define _DMACON2_DLYCYC1_POSITION                           0x5
#define _DMACON2_DLYCYC1_SIZE                               0x1
#define _DMACON2_DLYCYC1_LENGTH                             0x1
#define _DMACON2_DLYCYC1_MASK                               0x20
#define _DMACON2_DLYCYC2_POSN                               0x6
#define _DMACON2_DLYCYC2_POSITION                           0x6
#define _DMACON2_DLYCYC2_SIZE                               0x1
#define _DMACON2_DLYCYC2_LENGTH                             0x1
#define _DMACON2_DLYCYC2_MASK                               0x40
#define _DMACON2_DLYCYC3_POSN                               0x7
#define _DMACON2_DLYCYC3_POSITION                           0x7
#define _DMACON2_DLYCYC3_SIZE                               0x1
#define _DMACON2_DLYCYC3_LENGTH                             0x1
#define _DMACON2_DLYCYC3_MASK                               0x80

